## HANDLING DUPLICATE DATA

In [14]:
data3={
    'name':['ankit','sachin','sourav','ankit'],
    'age':[24,24,32,24],
    'profession':['sde','data','training','sde'],
    'salary':[5000,4000,4000,5000],
    'net_worth':[9000,8000,3000,9000]
}

In [15]:
import pandas as pd

In [16]:
df1=pd.DataFrame(data3)

In [17]:
df1

     name  age profession  salary  net_worth
0   ankit   24        sde    5000       9000
1  sachin   24       data    4000       8000
2  sourav   32   training    4000       3000
3   ankit   24        sde    5000       9000

In [19]:
df1.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [21]:
df1.duplicated().sum()

np.int64(1)

In [22]:
df1.drop_duplicates()

     name  age profession  salary  net_worth
0   ankit   24        sde    5000       9000
1  sachin   24       data    4000       8000
2  sourav   32   training    4000       3000